bankapp/app/Models/Userdb.php

	public function getuser($data)
	{
		$table = $this->db->table('user_reg');
		$table->where($data);
		$query = $table->get();
		if ($table->countAll() > 0)
---
SELECT COUNT(*) AS `numrows` FROM `user_reg`

	public function get_user_details($user_id)
	{
		$table1 = $this->db->table('user_reg');
		$table1->where("user_id",$user_id);
		$query1 = $table1->get();
		$dta['user'] = $query1->getRow();


		$where = 'transaction.user_id = '.$user_id.' OR  transaction.user_to ='.$user_id;
		  $table = $this->db->table("user_reg");
		  $table->select('user_reg.*, transaction.*, u2.user_email as t_u_email, (CASE WHEN user_to = '.$user_id.' or method = 1 THEN "Credit" ELSE "Debit" END) as type');
		  $table->join('transaction', 'user_reg.user_id = transaction.user_id', "left");
		  $table->join('user_reg u2', 'u2.user_id = transaction.user_to', "left");
		  $table->where($where);
		  $table->OrderBy("tr_date",'desc');
		  $query = $table->get();
			if ($table->countAll() > 0)
---
SELECT *
FROM `user_reg`
WHERE `user_id` = '1'
SELECT `user_reg`.*, `transaction`.*, `u2`.`user_email` as `t_u_email`, (CASE WHEN user_to = 1 or method = 1 THEN "Credit" ELSE "Debit" END) as type
FROM `user_reg`
LEFT JOIN `transaction` ON `user_reg`.`user_id` = `transaction`.`user_id`
LEFT JOIN `user_reg` `u2` ON `u2`.`user_id` = `transaction`.`user_to`
WHERE `transaction`.`user_id` = 1 OR  `transaction`.`user_to` = 1
ORDER BY `tr_date` DESC
SELECT COUNT(*) AS `numrows` FROM `user_reg`